

/* შექმენით სამი Int ტიპის ცვლადი, მიანიჭეთ მათ მნიშვნელობა და დაბეჭდეთ მათი ნამრავლი */

let number1 = 5
let number2 = 6
let number3 = 7

print(number1 * number2 * number3)

/* შექმენით int ტიპის ცვლადი, მიანიჭეთ მას მნიშვნელობა და შეამოწმეთ ეს რიცხვი ლუწია თუ კენტი ტერნარი ოპერატორით */

let num1 = 9
if num1 % 2 == 1 {
    print("ეს რიცხვი კენტია")
} else {
    print("ეს რიცხვი ლუწია")
}

/* შექმენით optional String-ის ტიპის და მიანიჭეთ თქვენი სახელის მნიშვნელობა. If let-ის მეშვეობით გაუკეთეთ unwrap და მნიშვნელობა დაპრინტეთ */

let saxeliGvari:String? = "გიორგი მიჩიტაშვილი"
if let unwrap = saxeliGvari {
    print(saxeliGvari!)
} else {
    print("Tim Cook")
}

/* შექმენით ცვლადი სახელად isRaining ბულეანის ტიპის და მიანიჭეთ თქვენთვის სასურველი მნიშვნელობა. If-else-ის მეშვეობით შეამოწმეთ თუ მნიშვნელობა მიიღებს true მნიშვნელობას დაბეჭდეთ “ქოლგის წაღება არ დამავიწყდეს”, სხვა შემთხვევაში “დღეს ქოლგა არ დამჭირდება” */

let isRaining = true
if isRaining == true {
    print("ქოლგგის წაღება არ დაგავიწყდეს")
} else {
    print("დღეს ქოლგა არ დამჭირდება")
}

/* შექმენით ორი int ტიპის ცვლადი a & b და მიანიჭეთ სასურველი რიცხვები. If-else-ით შეამოწმეთ თუ a მეტია b-ზე დაბეჭდეთ “a მეტია”,  სხვა შემთხვევაში “b მეტია”  */

let a = 7
let b = 11
if a > b {
    print("a მეტია")
} else {
    print("b მეტია")
}

/* შექმენით მუდმივა Character ტიპის და მიანიჭეთ თქვენი სახელის პირველი ასოს მნიშვნელობა */

var letter: Character = "G"

/* მოცემულია ორნიშნა რიცხვი, გაიგეთ არის თუ არა ერთიდაიმავე ციფრისგან შემდგარი*/

let newNum = 59
if  newNum / 10 == newNum % 10 {
    print("პირველი და მეორე რიცხვი ერთიდაიგივეა")
} else{
    print("პირველი და მეორე რიცხვი სხვადასხვა")
}

/* აიღეთ ცვლადი numberOfMonths მიანიჭეთ მნიშვნელობა და იმის მიხედვით თუ მერამდენე თვეა დაბეჭდეთ ის (გაზაფხული, ზაფხული, შემოდგომა, ზამთარი) შესაბამისად.*/

let numberOfMonths = 5
if numberOfMonths >= 3 && numberOfMonths <= 5 {
    print("გაზაფხული")
} else if numberOfMonths >= 6 && numberOfMonths <= 8 {
    print("ზაფხული")
} else if numberOfMonths >= 9 && numberOfMonths <= 11 {
    print("შემოდგომა")
} else {
    print("ზამთარი")
}
